// 1. Реализовать алгоритм обратной сортировки списков компаратором.
// 2. Пусть дан произвольный список целых чисел, удалить из него чётные числа
// 3. Задан целочисленный список ArrayList. Найти минимальное, максимальное и среднее из этого списка.
// 4. Дано два целочисленных списка, объеденить их не допуская элементы второго списка уже встречающиеся в первом.
// 5. Создать ArrayList<Integer> и добавить нулевым эллементом ноль 10000 раз.
// 6. Повторить пятый пункт но с LinkedList.
// 7. Сравнить время работы пятого и шестого пунктов.

public class HW3_20_04_23 {

    public static void main(String[] args) {

    }
}
